"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""
def m():
    first(13)
    second(100)
    third(50)

def first(par1):
    print(par1)

def second(par2):
    print(par2)

def third(par3):
    print(par3)


m()